Repository: autohotkey-docs-translation/v1-fr
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr

source: But don't be afraid to ask for help, we don't bite (hard).
fr: Mais il ne faut pas craindre de demander de l'aide, la communauté ne mord pas (fort).

source: But first, you need to find the script file.
fr: Mais d'abord il faut trouver le fichier de script.

source: But in fact they are needed.
fr: alors qu'elles sont nécessaires.

source: But in some cases you might want to specify criteria such as HWND, group or class.
fr: Mais dans certains cas il peut être nécessaire de spécifier d'autres critères comme HWND, le groupe ou la classe.

source: But now you are wondering "How can I make my really long Send commands readable?".
fr: "Comment puis-je garder lisible une commande Send très longue ?".

source: But that depends on the version you want.
fr: Mais cela dépend de la version voulue.

source: But there are some alternatives, try all the solutions mentioned below.
fr: Mais il y a des alternatives, essayer toutes les solutions décrites ci-dessous.

source: But you are now wondering if hotstrings have any cool modifiers since hotkeys do.
fr: Les hotstrings ont-ils aussi des modificateurs sympathiques, comme les hotkeys ?

source: ButtonSubmit:
fr: ButtonENVOYER:

source: By contrast, an operator of lower precedence such as add (+) is evaluated after a higher one such as multiply (*).
fr: En revanche, un opérateur de priorité moindre comme l'addition (+) est évalué après un opérateur plus prioritaire comme la multiplication (*).

source: By default this will open Notepad, but that can be changed by writing to the registry as shown here.
fr: Par défaut Notepad sera ouvert, ce qui peut être changé en modifiant le registre comme décrit ici.

source: By default, UAC protects "elevated" programs (that is, programs which are running as admin) from being automated by non-elevated programs, since that would allow them to bypass security restrictions.
fr: Par défaut, le contrôle du compte d'utilisateur protège les programmes "élevés" (c'est-à-dire, les programmes exécutés en tant qu'administrateurs) d'être automatisés par des programmes non-élevés, puisque cela leur permettrait de contourner des restrictions de sécurité.

source: By default, a linefeed (`n) is present between lines.
fr: Par défaut, un retour à la ligne (`n) est présent entre les lignes.

source: By default, double-clicking the tray icon shows the script's main window.
fr: Par défaut, double-cliquer cette icône affiche la fenêtre principale du script.

source: By default, each script adds its own icon to the taskbar notification area (commonly known as the tray).
fr: Par défaut, chaque script ajoute sa propre icône dans la zone de notification de la barre des tâches.

source: By default, the installer will enable the option if UAC is enabled and the UI Access context menu option was present before installation.
fr: Par défaut, l'installateur activera l'option si le contrôle du compte de l'utilisateur (UAC) est activé et si l'option de menu contextuel UI Access (accès UI) était présente avant installation.

source: ByRef parameters can also be optional.
fr: Les paramètres ByRef peuvent aussi être facultatifs.

source: B} is equivalent to {"A":
fr: B} équivaut à {"A":

source: B} uses the contents of the variable A as the key.
fr: B} utilise comme clé le contenu de la variable A.

source: C is okay.
fr: C va.

source: Call AutoHotkey.exe on the command line and pass the script's filename as a command-line parameter.
fr: Lancer AutoHotkey.exe en ligne de commande et passer le nom de fichier du script en paramètre de ligne de commande.

source: Can I draw something with AHK?
fr: Puis-je dessiner avec AutoHotkey ?

source: Can I find my script somewhere else?
fr: Que faire ?

source: Can I run AHK from a USB drive?
fr: Puis-je lancer AutoHotkey depuis un périphérique USB ?

source: Can I use wildcards or regular expressions in Hotstrings?
fr: Puis-je utiliser des caractères joker (wildcards) ou des expressions régulières dans des Hotstrings ?

source: CapsLock and IME
fr: VerrMaj et IME

source: Certain syntax errors are no longer tolerated
fr: Certaines erreurs de syntaxe ne sont plus tolérées

source: Certain syntax errors which were tolerated by AutoHotkey Basic are not tolerated by AutoHotkey_L.
fr: Certaines erreurs de syntaxe qui ont été tolérées par AutoHotkey Basic ne sont pas tolérées par AutoHotkey_L.

source: Changes made to those settings will not affect other threads.
fr: Les changements apportés à ces paramètres n'affecteront pas les autres fils d'exécution.

source: Choose what you like or learn to indent how you think it's easiest to read.
fr: Choisir ou apprendre ce qui plaît le plus ou ce qui semble le plus facile à lire.

source: Click "AutoHotkey Script" inside the "New" menu.
fr: Cliquer "AutoHotkey Script" dans le menu "Nouveau".

source: Click "Edit Script".
fr: Cliquer "Edit Script".

source: Click Programs or All Programs.
fr: Cliquer Programmes ou Tous les Programmes.

source: Click Download:
fr: Cliquer "Download" :

source: Click it.
fr: Cliquer dessus.

source: Clipboard = This text is copied to the clipboard.
fr: PressePapier = Ce texte est copié vers le presse-papier.

source: Closing this window with WinClose (even from another script) causes the script to exit, but most other methods just hide the window and leave the script running.
fr: Fermer cette fenêtre avec WinClose (même depuis un autre script) arrête le script, mais la plupart des autres méthodes ne font que cacher la fenêtre sans arrêter le script.

source: Code blocks
fr: Blocs de code

source: Colors might turn out black (0x000000) no matter the color you try to get.
fr: Les couleurs peuvent être obtenues noires (0x000000) peu importe la couleur cible.

source: Comma is used to delimit (separate) the parameters of a command, with some exceptions.
fr: La virgule est utilisée pour délimiter (séparer) les paramètres d'une commande, avec quelques exceptions.

source: Command
fr: Commande

source: Command Line Usage
fr: Utilisation en Ligne de Commande

source: Command and function list
fr: Liste des commandes et fonctions

source: Command, Parameter1, Parameter2, Parameter3
fr: Commande, Parametre1, Parametre2, Parametre3

source: Commands
fr: Commandes

source: Commands also differ from function in that they use "legacy syntax".
fr: Les commandes sont aussi différentes des fonctions au sens où elles utilisent une "syntaxe dépassée".

source: Commands and functions.
fr: en utilisant des Commandes et des Fonctions.

source: Commands do not use parentheses around the parameters like functions do.
fr: Les commandes n'utilisent pas de parenthèses autour des paramètres comme le font les fonctions.

source: Commands need an OutputVar parameter, functions do not.
fr: Les commandes ont besoin d'un paramètre VarSortie, pas les fonctions.

source: Commands such as ListVars and Pause can help you debug a script.
fr: Des commandes comme ListVars et Pause peuvent aider à déboguer script.

source: Commands vs Functions
fr: Commandes vs Fonctions

source: Commands vs. Functions()
fr: Commandes vs. Fonctions()

source: Commands which create pseudo-arrays
fr: Commandes créant des pseudo-tableaux

source: Comments
fr: Commentaires

source: Comments may also be added at the end of a line, in which case the semicolon must have at least one space or tab to its left.
fr: Des commentaires peuvent aussi être ajoutés en fin de ligne, auquel cas le point-virgule doit avoir au moins un espace ou une tabulation à sa gauche.

source: Common Tasks
fr: Tâches Courantes

source: Common workarounds are as follows:
fr: Les solutions courantes sont les suivantes :

source: Comparisons are performed using the same symbols as legacy If:
fr: Les comparaisons sont effectuées avec les même symboles que le If dépassé (legacy) :

source: Compatibility mode may cause confusion
fr: Le mode de compatibilité peut prêter à confusion

source: Compile Script (depending on the Install script compiler installation option)
fr: Compile Script (compiler le script) (selon l'option d'installation Install script compiler)

source: CompiledScript.exe [Switches] [Script Parameters]
fr: CompiledScript.exe [Commutateurs] [Paramètres du Script]

source: Compiling does not typically improve the performance of a script.
fr: La compilation n'améliore en général pas la performance d'un script.

source: Compressing Compiled Scripts
fr: Compression de Scripts Compilés

source: Consequently, ? (used in ternary operations) no longer requires a space on either side.
fr: Par conséquent, ? (utilisé dans les opérations ternaires) ne nécessite plus d'espace de chaque côté.

source: Consequently, any trailing slash in a quoted parameter (such as "C:\My Documents\") is treated as a literal quotation mark (that is, the script would receive the string C:\My Documents").
fr: En conséquence, tout antislash terminant un paramètre entre guillemets (comme "C:\Mes Documents\") est traité comme un guillemet littéral (c'est-à-dire, le script recevrait la chaîne de caractères C:\My Documents").

source: Consider the following example, which makes Numpad0 into a prefix key:
fr: Voir l'exemple suivant, qui fait de Numpad0 (0 sur le pavé numérique) une touche préfixe :

source: Continue on to section b.
fr: Continuer en section b.

source: Continue?
fr: Continuer ?

source: Control (or Ctrl)
fr: Control (ou Ctrl)

source: Control Flow Statements
fr: Instructions de Flux de Contrôle

source: Control Flow vs Commands
fr: Flux de Contrôle vs Commandes

source: Control flow statements can be applied to an entire block or just a single statement.
fr: Les instructions de flux de contrôle peuvent s'appliquer à tout un bloc ou à une seule instruction.

source: Control flow statements have syntax resembling commands, and are often referred to as such, but some differ from commands:
fr: Les instructions de flux de contrôle ont une syntaxe ressemblant à celle des commandes, et sont souvent désignées comme telles, mais certaines diffèrent des commandes :

source: Control flow statements which have a body and therefore must always be followed by a related statement or group of statements:
fr: Les instructions de flux de contrôle ayant un corps et devant donc toujours être suivies d'une instruction associée ou d'un groupe d'instructions :

source: Control-Z is not interpreted as end-of-file
fr: Control-Z n'est pas interprété comme une fin-de-fichier

source: ControlGetText, OutputVar
fr: ControlGetText, VarSortie

source: ControlGetText, OutputVar, Control, ExcludeTitle
fr: ControlGetText, VarSortie, Control, ExcludeTitle

source: ControlGetText, OutputVar, Control, WinTitle
fr: ControlGetText, VarSortie, Control, WinTitle

source: ControlGetText, OutputVar, Control,,, ExcludeTitle
fr: ControlGetText, VarSortie, Control,,, ExcludeTitle

source: ControlSend,, abc, game_title
fr: ControlSend,, abc, titre_jeu

source: Convert a .ahk script into a .exe file that can run on any PC.
fr: Convertir un script .ahk en un fichier .exe qui peut être exécuté sur un PC quelconque.

source: Convert a Script to an EXE (ahk2exe)
fr: Convertir un Script en EXE (ahk2exe)

source: Copies AutoHotkeyA32.exe, AutoHotkeyU32.exe and (if present) AutoHotkeyU64.exe to AutoHotkey*_UIA.exe.
fr: Copie AutoHotkeyA32.exe, AutoHotkeyU32.exe et (si présent) AutoHotkeyU64.exe vers AutoHotkey*_UIA.exe.

source: Corresponds to the <! hotkey prefix.
fr: Correspond au préfixe hotkey <!.

source: Corresponds to the <# hotkey prefix.
fr: Correspond au préfixe hotkey <#.

source: Corresponds to the <+ hotkey prefix.
fr: Correspond au préfixe hotkey <+.

source: Corresponds to the <^ hotkey prefix.
fr: Correspond au préfixe hotkey <^.

source: Corresponds to the >! hotkey prefix.
fr: Correspond au préfixe hotkey >!.

source: Corresponds to the ># hotkey prefix.
fr: Correspond au préfixe hotkey > #.

source: Corresponds to the >+ hotkey prefix.
fr: Correspond au préfixe hotkey > +.

source: Corresponds to the >^ hotkey prefix.
fr: Correspond au préfixe hotkey > ^.

source: Corresponds to the ! hotkey prefix.
fr: Correspond au préfixe hotkey !.

source: Corresponds to the + hotkey prefix.
fr: Correspond au préfixe hotkey +.

source: Corresponds to the ^ hotkey prefix.
fr: Correspond au préfixe hotkey ^.

source: Create a Script
fr: Créer un Script

source: Creates a self-signed digital certificate named "AutoHotkey" and signs each UIA file.
fr: Crée un certificat numérique auto-signé nommé "AutoHotkey" et signe chaque fichier UIA.

source: Creating Objects
fr: Créer des Objets

source: Currently, second must always contain a variable name in the second case; arbitrary expressions are not supported.
fr: Actuellement, deuxième doit toujours contenir un nom de variable dans le second cas ; des expressions arbitraires ne sont pas prises en charge.

source: Cursor Control Keys
fr: Touches pour contrôler le curseur de texte

source: Custom version info (as seen in Explorer's file-properties dialog) can be added to your compiled scripts by using a utility such as Resource Hacker (freeware) to edit the file "AutoHotkeySC.bin".
fr: Des informations de version personnalisées (comme vu dans les paramètres de fichier dans l'explorateur) peuvent être ajoutées aux scripts compilés en utilisant un utilitaire tel que Resource Hacker (logiciel gratuit) pour modifier le fichier "AutoHotkeySC.bin".

source: DPI scaling is enabled by default for GUIs
fr: La mise à l'échelle DPI est activée par défaut pour les interfaces graphiques

source: Debugging a Script
fr: Déboguer un Script

source: Delete
fr: Suppr

source: Delete (or Del)
fr: Delete (ou Del)

source: Delete method
fr: Méthode Delete (supprimer)

source: Different Equals
fr: Différents Egals

source: Disable UAC completely.
fr: Complètement désactiver le contrôle de compte d'utilisateur.

source: Disable or remove any extra software that came with your keyboard or mouse or change its driver to a more standard one such as the one built into the OS.
fr: Désactivez ou supprimez tout logiciel supplémentaire fourni avec votre clavier ou votre souris ou remplacez son pilote par un pilote plus standard, tel que celui intégré au système d'exploitation.

source: Disable the local security policy "Run all administrators in Admin Approval Mode" (not recommended).
fr: Désactiver la stratégie de sécurité locale "exécuter les comptes d’administrateurs en mode d’approbation d’administrateur" (Run all administrators in Admin Approval Mode) (non recommandé).

source: Documentation Conventions
fr: Conventions de la Documentation

source: Does it really contain a virus?
fr: Est-ce vraiment un virus ?

source: Don't be afraid to ask for help, even the smartest people ask others for help.
fr: Ne pas avoir peur de demander de l'aide, même les personnes les plus brillantes demandent de l'aide aux autres.

source: Don't be afraid to show what you tried, even if you think it's silly.
fr: Ne pas avoir peur de montrer les tentatives infructueuses, même si elles ont l'air stupides.

source: Done!
fr: Fini !

source: Dot notation
fr: Notation point (dot)

source: Double quotes (") have special meaning only within expressions.
fr: Les guillemets (") ont un sens particulier seulement dans les expressions.

source: Double-click a script file (or shortcut to a script file) in Explorer.
fr: Double-cliquer un fichier de script (ou un raccourci vers un fichier de script) dans l'Explorateur de fichiers.

source: Double-click that script's tray icon to open its main window.
fr: Double-cliquez sur l'icône de la barre d'état de ce script pour ouvrir sa fenêtre principale.

source: Double-click the file/icon in the desktop to run it.
fr: Double cliquer le fichier/l'icône sur le bureau pour l'exécuter.

source: Downloading and installing AutoHotkey
fr: Télécharger et installer AutoHotkey

source: Due to system behavior, the following keys seperated by a slash are identified differently depending on whether NumLock is ON or OFF.
fr: En raison du comportement du système, les touches suivantes séparées par une barre oblique sont identifiées différemment, dépendamment si Verr Num est activé ou désactivé.

source: During installation of AutoHotkey, you will be asked to choose from UNICODE or ANSI.
fr: Pendant l'installation de AutoHotkey, il faudra choisir entre UNICODE et ANSI.

source: During loading, the script is optimized and validated.
fr: Pendant le chargement, le script est optimisé et validé.

source: Dynamic Variables
fr: Variables Dynamiques

source: Each comment can appear to the right of a line or on a new line by itself.
fr: Chaque commentaire peut apparaître à droite d'une ligne ou seul sur une nouvelle ligne.

source: Each has their own special features.
fr: Chacune a ses particularités propres.

source: Each parameter of a command may accept different syntax, depending on the command.
fr: Chaque paramètre d'une commande peut suivre différentes syntaxes, selon la commande.

source: Each script is a plain text file containing lines to be executed by the program (AutoHotkey.exe).
fr: Chaque script est un simple fichier texte contenant les lignes à faire exécuter par le programme (AutoHotkey.exe).

source: Easy.
fr: Facile.

source: Edit Script
fr: Edit Script (modifier le script)

source: Edit This Script - See Edit.
fr: Edit This Script - Voir Edit.

source: Edit a Script
fr: Modifier un Script

source: Enable the Add 'Run with UI Access' to context menus option in AutoHotkey Setup.
fr: Activer l'option Add 'Run with UI Access' to context menus (Ajouter 'Lancer avec accès UI' aux menus contextuels) dans l'installateur de AutoHotkey.

source: Enclose a variable name in percent signs to include the contents of that variable.
fr: Mettre le nom d'une variable entre signes pourcentage pour inclure le contenu de cette variable.

source: End
fr: Fin

source: Enjoy!
fr: Bonne fin de lecture !

source: Ensure that at least one script is running that is using the keyboard hook.
fr: Assurez-vous qu'au moins un script en cours d'exécution utilise le hook clavier.

source: Enter
fr: Entrée

source: Equal signs (=) with a symbol in front of it such as := += -= .= etc. are called assignment operators and always require an expression.
fr: Les signes égal (=) avec un symbole devant comme := += -= .= etc. sont appelés opérateurs d'affectation et ont toujours besoin d'une expression.

source: Errors may or may not be detected automatically:
fr: Les erreurs peuvent ou non être détectées automatiquement:

source: Escape (or Esc)
fr: Escape (ou Esc)

source: Every thread launched by a hotkey, hotstring, menu item, GUI event, or timer starts off fresh with the default values for the following attributes as set in the auto-execute section.
fr: Chaque fil d'exécution (thread) lancé par hotkey, hotstring, élément de menu, évènement de GUI, ou minuterie démarre de zéro avec les valeurs par défaut pour les attributs suivants telles que définies dans la section d'auto-exécution.

source: Everywhere in expressions.
fr: Partout dans les expressions.

source: Example string:
fr: Exemple de chaîne de texte:

source: Examples
fr: Exemples

source: Exception handling:
fr: Traitement des exceptions :

source: Execution of a subroutine halts if it reaches a return, regardless of which file that return is in.
fr: L'exécution d'un sous-programme termine en atteignant un return, sans considération pour le fichier dont le return provient.

source: Exit - Exit the script.
fr: Exit - Terminer le script.

source: Explicit concatenation:
fr: Concaténation explicite :

source: Expression Statements
fr: Instructions Expression

source: Expression mixed assignment
fr: Affectation par expression mixte

source: Expression number assignment
fr: Affectation par expression de nombre

source: Expression text assignment
fr: Affectation par expression de texte

source: Expression variable assignment
fr: Affectation par expression de variable

source: Expressions starting with (.
fr: Les expressions commençant par (.

source: Expressions starting with the new operator, as in new ClassName, because sometimes a class can be instantiated just for its side-effects.
fr: Les expressions commençant par l'opérateur new, comme new NomClasse, car parfois une classe peut n'être instanciée que pour ses effets de bord.

source: Expressions that start with any of those described above (but not those described below) are also allowed, for simplicity.
fr: Les expressions qui commencent avec une des expressions décrites ci-dessus (mais pas celles décrites ci-dessous) sont aussi autorisées, pour des raisons de simplicité.

source: Expressions vs Legacy Syntax
fr: Expressions vs Syntaxe Dépassée (legacy)

source: False positives might be more common for compiled scripts which have been compressed, such as with UPX (default for AutoHotkey 1.0 but not 1.1) or MPRESS (optional for AutoHotkey 1.1).
fr: Les faux positifs peuvent être plus courants pour les scripts compilés qui ont été compressés, comme avec UPX (par défaut pour AutoHotkey 1.0 mais pas 1.1) ou MPRESS (optionnel pour AutoHotkey 1.1).

source: Favorites
fr: Favoris

source: FileAppend, %Var%, C:\My File.txt
fr: FileAppend, %Var%, C:\Mon Fichier.txt

source: FileAppend, This is the text to append.`n
fr: FileAppend, Ceci est le texte à ajouter.`n

source: FileDelete, C:\My Temp File.txt
fr: FileDelete, C:\Mon Fichier Temporaire.txt

source: FileExist(VariableContainingPath)
fr: FileExist(VariableContenantChemin)

source: FileRead may return corrupt binary data
fr: FileRead peut renvoyer des données binaires corrompues

source: FileRead, VarToContainContents, C:\My Temp File.txt
fr: FileRead, VarAvecContenu, C:\Mon Fichier Temporaire.txt

source: Finally, AutoHotkey would not be what it is today without these other individuals.
fr: Enfin, AutoHotkey ne serait pas ce qu'il est aujourd'hui sans ces autres personnes.

source: Finally, blank lines or comments may be added between or at the end of any of the lines in the above examples.
fr: Enfin, des lignes vides ou des commentaires peuvent être ajoutés entre les lignes, ou à la fin de chaque ligne comme dans les exemples ci-dessus.

source: Finally, there are several built-in date/time variables, as well as the FormatTime command to create a custom date/time string.
fr: Enfin, il y a plusieurs variables de date/temps intégrées, et la commande FormatTime permet de créer une chaîne de caractère avec date/temps personnalisée.

source: Find "New" in the menu.
fr: Trouver "Nouveau" dans le menu.

source: Find AutoHotkey in the list.
fr: Trouver AutoHotkey dans la liste.

source: Find My Computer or Computer.
fr: Trouver Poste de travail ou Ordinateur.

source: Find out what has changed compared to AutoHotkey 1.0 and how much the impact is.
fr: Découvrez ce qui a changé par rapport à AutoHotkey 1.0 et quel en est l'impact.

source: Find the Start menu or Start Orb on your screen, usually in the lower left.
fr: Trouver le menu Démarrer ou le bouton Démarrer sur l'écran, en général en bas à gauche.

source: Find the newly created file on your desktop and right-click it.
fr: Trouver le fichier nouvellement créé sur le bureau et faire un clic droit dessus.

source: Find the script file, select it, and press Control+C.
fr: Trouver le fichier de script, le sélectionner, appuyer sur Ctrl+C.

source: Finding your AHK version
fr: Trouver la version de AutoHotkey

source: First, here is an example that closes another script:
fr: D'abord, voici un exemple qui ferme un autre script :

source: For AutoHotkey versions older than 1.1.08.00, use uninst.exe /S.
fr: Pour les versions de AutoHotkey plus vieilles que 1.1.08.00, utiliser uninst.exe /S.

source: For Example:
fr: Par exemple :

source: For a basic explanation and general details about variables, see Variables.
fr: Pour une explication basique et les détails d'ordre général des variables, voir Variables.
